In [1]:
import numpy as np
import pandas as pd

In [4]:
data_dict = {"Department" : ["Software", "Software", "Marketing", "Marketing", "Law", "Law"],
             "Name" : ["John", "Gabriele", "Nicolo", "Antonio", "Goytacaz", "Wendel"],
             "Wage" : [100, 150, 200, 300, 400, 500]
            }

In [5]:
df = pd.DataFrame(data_dict)
df

  Department      Name  Wage
0   Software      John   100
1   Software  Gabriele   150
2  Marketing    Nicolo   200
3  Marketing   Antonio   300
4        Law  Goytacaz   400
5        Law    Wendel   500

In [6]:
grouped_df = df.groupby("Department")

In [7]:
grouped_df.count()

            Name  Wage
Department
Law            2     2
Marketing      2     2
Software       2     2

In [8]:
grouped_df.min()

                Name  Wage
Department
Law         Goytacaz   400
Marketing    Antonio   200
Software    Gabriele   100

In [9]:
grouped_df.mean()

             Wage
Department
Law         450.0
Marketing   250.0
Software    125.0

In [10]:
grouped_df.describe()

            Wage
           count   mean        std    min    25%    50%    75%    max
Department
Law          2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Marketing    2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Software     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0